STMicroelectronics/STM32CubeWB0/Projects/NUCLEO-WB07CC/Applications/BLE/BLE_SerialPort_CentralPeripheral/STM32_BLE/App/gatt_client_app.c
static void gatt_parse_notification(aci_gatt_clt_notification_event_rp0 *p_evt)
{
  APP_DBG_MSG("ACI_GATT_NOTIFICATION_VSEVT_CODE - ConnHdl=0x%04X, Attribute_Handle=0x%04X\n",
              p_evt->Connection_Handle,
              p_evt->Attribute_Handle);
/* USER CODE BEGIN gatt_parse_notification_1 */
  uint16_t attr_handle;
  APP_DBG_MSG("gatt_parse_notification\n");

  attr_handle = p_evt->Attribute_Handle;
  if(attr_handle == tx_handle+1)
  {
    for(int i = 0; i < p_evt->Attribute_Value_Length; i++) 
        printf("%c", p_evt->Attribute_Value[i]);
  }
  else
  {
      printf("Received data from not recognized attribute handle 0x%4X\n", p_evt->Attribute_Handle);
  }
/* USER CODE END gatt_parse_notification_1 */

  return;
}

static void client_discover_all(void)
{
  uint8_t index;

  for(index = 0; index < CFG_BLE_NUM_CLIENT_CONTEXTS; index++)
  {
    if(a_ClientContext[index].state == GATT_CLIENT_APP_DISCOVER_SERVICES)
    {
      gatt_procedure(index, PROC_GATT_DISC_ALL_PRIMARY_SERVICES);
      gatt_procedure(index, PROC_GATT_DISC_ALL_CHARS);
      gatt_procedure(index, PROC_GATT_DISC_ALL_DESCS);
      gatt_procedure(index, PROC_GATT_ENABLE_ALL_NOTIFICATIONS);

      a_ClientContext[index].state = GATT_CLIENT_APP_CONNECTED;

      /* Check if in the meantime another server has been connected. */
      UTIL_SEQ_SetTask( 1U << CFG_TASK_DISCOVER_SERVICES_ID, CFG_SEQ_PRIO_0);

      break;
    }
  }

  return;
}

static void gatt_cmd_resp_release(void)
{
  UTIL_SEQ_SetEvt(1U << CFG_IDLEEVT_PROC_GATT_COMPLETE);
  return;
}

static void gatt_cmd_resp_wait(void)
{
  UTIL_SEQ_WaitEvt(1U << CFG_IDLEEVT_PROC_GATT_COMPLETE);
  return;
}

/* USER CODE BEGIN LF */

void SerialPort_Client_Write_Char__set_params(uint8_t* i_a_buffSpTx, uint8_t i_buffSpTxLen)
{
  buffSpTxLen = i_buffSpTxLen;
  memcpy(&a_buffSpTx[0], &i_a_buffSpTx[0], i_buffSpTxLen);
}

static void SerialPort_Client_Write_Char(void)


{
  uint8_t index = 0;
  tBleStatus ret = BLE_STATUS_INVALID_PARAMS;

  for(index = 0; index < CFG_BLE_NUM_CLIENT_CONTEXTS; index++)
  {
    if (a_ClientContext[index].state == GATT_CLIENT_APP_CONNECTED)
    {
      ret = aci_gatt_clt_write_without_resp(a_ClientContext[index].connHdl,
                                            BLE_GATT_UNENHANCED_ATT_L2CAP_CID,
                                            a_ClientContext[index].SerialPortWriteToServerValueHdl,
                                            buffSpTxLen,
                                            (uint8_t *)&a_buffSpTx);

      if (ret != BLE_STATUS_SUCCESS)
      {
        APP_DBG_MSG("aci_gatt_clt_write_without_resp failed, connHdl=0x%04X, ValueHdl=0x%04X\n",
                    a_ClientContext[index].connHdl,
                    a_ClientContext[index].SerialPortWriteToServerValueHdl);
      }
    }
  }

  return;
}

/* USER CODE END LF */
